## Import Libraries

In [1]:
import numpy as np,pandas as pd,warnings

In [2]:
df=pd.read_csv('C:\python\Machine learning\Datasets\Titanic1.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df.shape

(418, 12)

In [5]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin',"Embarked"],axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [6]:
df.isnull().sum()

Survived     0
Pclass       0
Sex          0
Age         86
Fare         1
dtype: int64

## Mapping text data to binary value

In [7]:
df['Sex']=df['Sex'].map({'female':0,'male':1}).astype(int)
df.head()

   Survived  Pclass  Sex   Age     Fare
0         0       3    1  34.5   7.8292
1         1       3    0  47.0   7.0000
2         0       2    1  62.0   9.6875
3         0       3    1  27.0   8.6625
4         1       3    0  22.0  12.2875

In [8]:
x=df.drop('Survived',axis='columns')

In [9]:
y=df.Survived

## To check is there any null value present in any column and fill them

In [10]:
x.columns[x.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [11]:
x.Age=x.Age.fillna(x.Age.median())

In [12]:
x.columns[x.isna().any()]

Index(['Fare'], dtype='object')

In [13]:
x.Fare=x.Fare.fillna(x.Fare.median())

## Splitting dataset into Train and Test

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=10)

## Standard Scaling

In [16]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

## Training

In [17]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(x_train,y_train)

GaussianNB()

### Predicting wheather person survived or not

In [18]:
pclassno=int(input("Enter Person's Pclass number:"))
gender=int(input("Enter Person's Gender 0-female 1-male(0 or 1):"))
age=int(input("Enter Person's Age:"))
fare=float(input("Enter person's Fare"))
person=[[pclassno,gender,age,fare]]
result=model.predict(person)
print(result)

if result==1:
    print("Person might be survived")
else:
    print("Person might not be survived")

Enter Person's Pclass number:3
Enter Person's Gender 0-female 1-male(0 or 1):0
Enter Person's Age:47
Enter person's Fare7
[0]
Person might not be survived

## Prediction for dataset

In [19]:
y_pred=model.predict(x_test)
y_pred

array([1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1], dtype=int64)

In [20]:
from sklearn.metrics import accuracy_score,confusion_matrix
print("Accuracy of the model is:{0}%".format(accuracy_score(y_test,y_pred)*100))

Accuracy of the model is:100.0%

In [21]:
cm=confusion_matrix(y_test,y_pred)
cm

array([[60,  0],
       [ 0, 45]], dtype=int64)